In [3]:
import pandas as pd

In [4]:
#* df --->DataFrame dir pandas df ler ile çalışır. Devbir excel gibi düşün df yi.
df = pd.read_csv(
    filepath_or_buffer='Data/imdb.csv'
)

# DATA FILTERING

# Data Filtering (Veri Filtreleme) Nedir?
Tanım:
Data filtering, veriyi koşullara göre süzerek yalnızca analiz için gerekli kısmını elde etme işlemidir.

İşlev:
Veri filtrelemenin temel işlevi, veri setini analiz amacına uygun hale getirmektir.

Amaç:
Veriyi analiz öncesi sadeleştirmek, odaklanmak istenen bilgiye ulaşmak ve performansı artırmaktır.

Yöntem:
Pandas'ta filtreleme için birden fazla yöntem kullanılır, ancak en yaygın olanları şunlardır:

Mantıksal Koşullar (Boolean Indexing):

Bir veya daha fazla sütuna uygulanan karşılaştırma operatörleri (>, <, ==, !=, vb.) ve mantıksal operatörler (& (VE), | (VEYA), ~ (DEĞİL)) kullanılarak yapılanlar.

Örnek: df[df['Yaş'] > 30]

.loc ve .iloc Indexleyiciler:

.loc (etiket tabanlı): Satır ve sütunları etiket adlarıyla seçerken mantıksal koşullar da uygulayabilir.

.iloc (konum tabanlı): Satır ve sütunları tam sayı konumlarıyla seçer (filtreleme için daha az kullanılır, ancak alt kümeleme için önemlidir).

.isin() Metodu:

Bir sütundaki değerlerin, bir listede bulunan değerlerden herhangi biri olup olmadığını kontrol eder. Çoklu değer kontrolü için çok etkilidir.

Örnek: df[df['Şehir'].isin(['Ankara', 'İstanbul'])]

.str Erişimcisi:

Dize (string) tabanlı sütunlarda metin filtrelemesi yapmak için kullanılır (örneğin, belirli bir kelimeyi içeren veya belirli bir harfle başlayan satırlar).

Örnek: df[df['Ürün Adı'].str.contains('Premium')]

In [30]:
df.columns

Index(['Movie_Title', 'YR_Released', 'Rating', 'Num_Reviews', 'Movie_ID',
       'Record', 'Runtime'],
      dtype='object')

In [ ]:
# todo: YR_Released sütunundan 2000 yılından sonra yayınlanmış filmlerin Movie_Title YR_Released , Rating sütunlarındaki verileri çeken bir sorgu yazın.
# todo: ayrıca Rating satırında bulunan verilere göre puanı en yüksekten sen düşüğe olacak şekilde sıralayın. select yaptık sutun seçtik sonrada sıraladık. bu veriseti için rapourumsu bir sorgu yazdık
(
    df.query('YR_Released > 2000')
        .loc[: , ['Movie_Title' , 'YR_Released' , 'Rating']]
        .sort_values(by='Rating', ascending= False)
)

# genelde filtre attığın değere göre sıralarsın. Yani burada sort atarken YR_Released e göre atılmalı biz yapmadık.

                                           Movie_Title  YR_Released  Rating
103                                    The Dark Knight         2008     9.0
603                                    The Dark Knight         2008     9.0
607      The Lord of the Rings: The Return of the King         2003     8.9
106      The Lord of the Rings: The Return of the King         2003     8.9
109  The Lord of the Rings: The Fellowship of the Ring         2001     8.8
..                                                 ...          ...     ...
5                                         Pledge This!         2006     1.7
2                         Superbabies: Baby Geniuses 2         2004     1.6
3                                    Daniel the Wizard         2004     1.6
1                                     Saving Christmas         2014     1.5
0                                    Code Name: K.O.Z.         2015     1.4

[405 rows x 3 columns]

In [5]:
import time

start = time.time_ns()

(
    df.query('YR_Released > 2000')
        .loc[: , ['Movie_Title' , 'YR_Released' , 'Rating']]
        .sort_values(by='Rating', ascending= False)
)

finish = time.time_ns()

print(finish - start )

32781100

In [ ]:
# her iki kodda aynı işi yapar query daha okunaklıdır.Bu daha karısıktır.

df[df['YR_Released'] > 2000][['Movie_Title', 'YR_Released' , 'Rating']].sort_values(by='Rating', ascending= False)

                                           Movie_Title  YR_Released  Rating
103                                    The Dark Knight         2008     9.0
603                                    The Dark Knight         2008     9.0
607      The Lord of the Rings: The Return of the King         2003     8.9
106      The Lord of the Rings: The Return of the King         2003     8.9
109  The Lord of the Rings: The Fellowship of the Ring         2001     8.8
..                                                 ...          ...     ...
5                                         Pledge This!         2006     1.7
2                         Superbabies: Baby Geniuses 2         2004     1.6
3                                    Daniel the Wizard         2004     1.6
1                                     Saving Christmas         2014     1.5
0                                    Code Name: K.O.Z.         2015     1.4

[405 rows x 3 columns]

In [6]:
import time

start1 = time.time_ns()

df[df['YR_Released'] > 2000][['Movie_Title', 'YR_Released' , 'Rating']].sort_values(by='Rating', ascending= False)


finish1 = time.time_ns()

print(finish1 - start1 )

4442100

In [ ]:
32781100>4442100

True

method chaining (veya zincirleme metot kullanımı)  query-style filtering daha teknik söylemiyle expression-based filtering ile yazmaktan daha kısa sürmektedir.

In [33]:
# ? Rating sütunundaki verilerin 7.0 ile 9.0 arasındaki verileri içeren 'Movie_Title','YR_Released', 'Rating' sütunlarını listeleyin.

(
    df.query('Rating > 7.0 and Rating < 9.0')
    .loc[: , ['Movie_Title' , 'YR_Released' , 'Rating']]
        .sort_values(by='Rating', ascending= False)
)

# and yazarken hem & hem de and yazabiliriz.

                                       Movie_Title  YR_Released  Rating
105                               Schindler's List         1993     8.9
604                                   12 Angry Men         1957     8.9
607  The Lord of the Rings: The Return of the King         2003     8.9
606                                   Pulp Fiction         1994     8.9
605                               Schindler's List         1993     8.9
..                                             ...          ...     ...
574                                Koi... Mil Gaya         2003     7.1
575                            Atharintiki Daaredi         2013     7.1
576                            Rab Ne Bana Di Jodi         2008     7.1
563                                 Gabbar is Back         2015     7.1
564                                      Raajneeti         2010     7.1

[728 rows x 3 columns]

In [34]:
# ? Num_Reviews >30000 den büyük ve YR_Released >2000 olan filmlerin Movie_Title, Num_Reviews, YR_Released sütunlarını, Num_Reviews  
# ? e göre çoktan aza sıralancak şekilde listeleyin. 
(
    df.query('Num_Reviews > 30000 and YR_Released >2000')
    .loc[: , ['Movie_Title' ,'Num_Reviews' , 'YR_Released' ]]
        .sort_values(by='Num_Reviews', ascending= False)
)

,Movie_Title,Num_Reviews,YR_Released
103,The Dark Knight,1808543,2008
603,The Dark Knight,1808543,2008
112,Inception,1599451,2010
613,Inception,1599451,2010
109,The Lord of the Rings: The Fellowship of the Ring,1332276,2001
...,...,...,...
245,Song of the Sea,33885,2014
27,House of the Dead,33007,2003
403,Lage Raho Munna Bhai,32370,2006
553,Talaash,31726,2012
452,Vicky Donor,30449,2012

In [35]:
# ? Num_Reviews 1808543 ya da 1599451 ya da 1332276 olan filmlerin Movie_Title, Num_Reviews, Rating sütunlarını, Num_Reviews  
# ? e göre çoktan aza sıralancak şekilde listeleyin.

(
    df.query('Num_Reviews == 1808543 | Num_Reviews == 1599451 | Num_Reviews == 1332276')
    .loc[: , ['Movie_Title' ,'Num_Reviews' , 'Rating' ]]
        .sort_values(by='Num_Reviews', ascending= False)
)

# & → AND

# | → OR

# ~ → NOT

                                           Movie_Title  Num_Reviews  Rating
103                                    The Dark Knight      1808543     9.0
603                                    The Dark Knight      1808543     9.0
613                                          Inception      1599451     8.7
112                                          Inception      1599451     8.7
109  The Lord of the Rings: The Fellowship of the Ring      1332276     8.8
610  The Lord of the Rings: The Fellowship of the Ring      1332276     8.8

In [36]:
# ? Movie_Title içerisinde 'King' ifadesi geçen ve YR_Released >2000 olan filmlerin, Movie_Title, Num_Reviews, YR_Released sütunlarını, Num_Reviews  
# ? e göre  azdan çoka sıralancak şekilde listeleyin.

In [37]:
(
df.query('Movie_Title.str.contains("King") & YR_Released >2000 ') 
    .loc[:, ['Movie_Title', 'Num_Reviews' , 'YR_Released']] 
    .sort_values(by='Num_Reviews', ascending=True)

)

                                       Movie_Title  Num_Reviews  YR_Released
329                              The King's Speech       538099         2010
106  The Lord of the Rings: The Return of the King      1311271         2003
607  The Lord of the Rings: The Return of the King      1311271         2003

In [38]:
df[(df['Movie_Title'].str.contains("King")) & (df['YR_Released'] > 2000)][['Movie_Title', 'Num_Reviews', 'YR_Released']].sort_values(by='Num_Reviews', ascending=True)

                                       Movie_Title  Num_Reviews  YR_Released
329                              The King's Speech       538099         2010
106  The Lord of the Rings: The Return of the King      1311271         2003
607  The Lord of the Rings: The Return of the King      1311271         2003

# .loc & .iloc

.loc vs .iloc nedir? 

Pandas'taki .loc[] ve .iloc[] özellikleri, bir Pandas DataFrame'indeki belirli satırlara ve sütunlara erişmek (veya bir veri kümesini dilimlemek) için kullanılır.

.loc komutu etiket tabanlıdır. 

.iloc komutu ise integer tabanlıdır. Yani .loc komutunu kullanırken satır ya da sütun adı söyleriz fakat .iloc komutunda o satır veya sütunun numarasını belirtiriz. iloc index bazlı olarak ilerler.

.loc[] özelliği etiket indekslemesi için kullanılırken, .iloc[] özelliği tam sayı indekslemesi için kullanılır.

# .loc[ ]

In [39]:
# todo: loc iki değer alır. ilki satırın etiketi, ikincisi sütunun etiketidir.
#  ":" bütün satırlar demektedir. Çıktısı ise dataframe dir.
df.loc[1, 'Movie_Title']

'Saving Christmas'

In [40]:
# todo: 5 ile 10 satıra arasındaki Movie Title listeleyin
df.loc[5:10, 'Movie_Title']

5                       Pledge This!
6      Dünyayi Kurtaran Adam'in Oglu
7                         Foodfight!
8         Birdemic: Shock and Terror
9                           Álom.net
10    Titanic - La leggenda continua
Name: Movie_Title, dtype: object

In [20]:
# todo: ilk 10 satırın Movie_Title ekrana basın
df.loc[:10, 'Movie_Title']

0                  Code Name: K.O.Z.
1                   Saving Christmas
2       Superbabies: Baby Geniuses 2
3                  Daniel the Wizard
4           Manos: The Hands of Fate
5                       Pledge This!
6      Dünyayi Kurtaran Adam'in Oglu
7                         Foodfight!
8         Birdemic: Shock and Terror
9                           Álom.net
10    Titanic - La leggenda continua
Name: Movie_Title, dtype: object

In [21]:
# todo: 10 ile 20 satır arasındaki verinin Movie_Title ve Num_Reviews sütunlarında bulunan veriyi listeleyin
df.loc[10:20, ['Movie_Title', 'Num_Reviews']]

                        Movie_Title  Num_Reviews
10   Titanic - La leggenda continua         8421
11                   Disaster Movie        77553
12                    Zombie Nation         7730
13          The Hottie & the Nottie        34098
14       Keloglan Karaprens'e Karsi         8502
15             From Justin to Kelly        23920
16                     A Fox's Tale         7953
17  Ram Gopal Varma's Indian Flames         6028
18                  Going Overboard        10938
19         Emret Komutanim: Sah Mat         6354
20     Attack of the Jurassic Shark         2983

In [44]:
# todo: ilk 20 satırın Movie_Title ve Num_Reviews ve Rating sutunlarını getirin. İstenilen sütunlar iki olunda çıktı dataframedir.
df.loc[:20, ['Movie_Title', 'Num_Reviews', 'Rating']]

                        Movie_Title  Num_Reviews  Rating
0                 Code Name: K.O.Z.        24623     1.4
1                  Saving Christmas        12765     1.5
2      Superbabies: Baby Geniuses 2        26505     1.6
3                 Daniel the Wizard        13295     1.6
4          Manos: The Hands of Fate        31808     1.7
5                      Pledge This!        15836     1.7
6     Dünyayi Kurtaran Adam'in Oglu        14110     1.8
7                        Foodfight!         5740     1.8
8        Birdemic: Shock and Terror        15919     1.8
9                          Álom.net         8502     1.9
10   Titanic - La leggenda continua         8421     1.9
11                   Disaster Movie        77553     1.9
12                    Zombie Nation         7730     1.9
13          The Hottie & the Nottie        34098     1.9
14       Keloglan Karaprens'e Karsi         8502     1.9
15             From Justin to Kelly        23920     1.9
16                     A Fox's Tale         7953     1.9
17  Ram Gopal Varma's Indian Flames         6028     1.9
18                  Going Overboard        10938     2.0
19         Emret Komutanim: Sah Mat         6354     2.0
20     Attack of the Jurassic Shark         2983     2.0

In [45]:
result = df.loc[:20, ['Movie_Title', 'Num_Reviews', 'Rating']]
print(type(result))

<class 'pandas.core.frame.DataFrame'>

# .iloc[ ]

In [ ]:
# iloc çıktısı pandas serisidir.
# ilk istenilen satır indexleri ve sonraki istenilen de sütun indexleridir.

df['Movie_Title']

0                                      Code Name: K.O.Z.
1                                       Saving Christmas
2                           Superbabies: Baby Geniuses 2
3                                      Daniel the Wizard
4                               Manos: The Hands of Fate
                             ...
845    Pirates of the Caribbean: The Curse of the Bla...
846                     What Ever Happened to Baby Jane?
847                                         Paris, Texas
848                                             Drishyam
849                                                   PK
Name: Movie_Title, Length: 850, dtype: object

In [27]:
result = df['Movie_Title']
print(type(result))

<class 'pandas.core.series.Series'>

In [22]:
df.iloc[0:5,0]

0               Code Name: K.O.Z.
1                Saving Christmas
2    Superbabies: Baby Geniuses 2
3               Daniel the Wizard
4        Manos: The Hands of Fate
Name: Movie_Title, dtype: object

In [23]:
#  1-10 satır ve 0 ve 1. sutünlardaki verileri alalım.
df.iloc[1:10, [0,1]]

                     Movie_Title  YR_Released
1               Saving Christmas         2014
2   Superbabies: Baby Geniuses 2         2004
3              Daniel the Wizard         2004
4       Manos: The Hands of Fate         1966
5                   Pledge This!         2006
6  Dünyayi Kurtaran Adam'in Oglu         2006
7                     Foodfight!         2012
8     Birdemic: Shock and Terror         2010
9                       Álom.net         2009

In [ ]:
#1 ve 7. satırlar 0 ve 2. sutündaki bilgileri getirin. 
df.iloc[[1,7] , [0,2]]

        Movie_Title  Rating
1  Saving Christmas     1.5
7        Foodfight!     1.8

In [ ]:
# Çıktı almak istediğin pandas serisini de filtreleyebilirsin, matematiksel işleme de sokabilirsin.
# Slicing (Dilimleme)

df['Movie_Title'][10:20]

10     Titanic - La leggenda continua
11                     Disaster Movie
12                      Zombie Nation
13            The Hottie & the Nottie
14         Keloglan Karaprens'e Karsi
15               From Justin to Kelly
16                       A Fox's Tale
17    Ram Gopal Varma's Indian Flames
18                    Going Overboard
19           Emret Komutanim: Sah Mat
Name: Movie_Title, dtype: object

In [48]:
import time

start = time.time_ns()


df['Movie_Title'][10:20]


finish = time.time_ns()

print(finish - start)

3733500

In [ ]:
# dataframeler de filtrelenebilir.
# BU EN HIZLI OLAN VERİÇIKARMA YÖNETİMİDİR.
#DataFrame, verinin etiketli (index–değer) yapı içinde tutulduğu bir tablodur.Bu yapı doğrudan matematiksel işlemler için optimize edilmemiştir; 
# ancak NumPy array’ler ham sayısal veri içerdiğinden matematiksel işlemler çok daha hızlı ve verimli yapılabilir. 
#Daha performanslı olması için dataframe, compiting power(hesaplama gücü)  için numpy array tercih edilmelidir.
# Bir makine öğrenmesi projesinde de de bu yöntemle karşılaşabilirsiniz.
# sql deki veriyi select etmedir.
# Chained Indexing: Birden fazla indeksleme/metodun ardışık kullanımı; genellikle kolon seçip ardından satır seçme ile yapılır.


df[
    ['Movie_Title', 'Rating']
][5:10]

                     Movie_Title  Rating
5                   Pledge This!     1.7
6  Dünyayi Kurtaran Adam'in Oglu     1.8
7                     Foodfight!     1.8
8     Birdemic: Shock and Terror     1.8
9                       Álom.net     1.9

In [49]:
import time

start1 = time.time_ns()

df[
    ['Movie_Title', 'Rating']
][5:10]

finish1 = time.time_ns()

print(finish1 - start1 )

2254500

In [50]:
2254500<3733500

True

Slicing (Dilimleme) ve  Chained Indexing   kıyaslandığında Chained Indexing  ile filtreleme işlemi daha kısa sürmektedir.